# Exam Modul 2

## import libraries

In [4]:
import pandas as pd 
import numpy as np 
import sqlalchemy as alc 
from sqlalchemy import create_engine

# Soal 1 - PyMySQL - Sakila Database

## create connection

In [5]:
engine = create_engine('mysql+mysqlconnector://root:rafdyrizq@localhost/sakila')

In [6]:
# show full tables

query='''
show full tables;
'''
pd.read_sql_query(query, engine)

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

1. Tampilkan daftar 10 film komedi dengan durasi tersingkat.

In [ ]:
# menampilkan table yang diperlukan

In [8]:
query='''
select * from film_category
limit 1;
'''
pd.read_sql_query(query,engine)

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09

In [9]:
query='''
select * from film
limit 1;
'''
pd.read_sql_query(query,engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42

In [10]:
query='''
select * from category
limit 1;
'''
pd.read_sql_query(query,engine)

   category_id    name         last_update
0            1  Action 2006-02-15 04:46:27

In [17]:
# select untuk memilih kolom apa saja yg mau ditampilkan
# from dan join menghubungkan antar tabel dengan using kolom yg memiliki value yg sama
# where untuk condition memilih category Comedy
# diurutkan berdasarkan length di table film secara ascending
# limit 10 untuk membatasi 10 urutan teratas

query='''
select 
film.title as title,
category.name as category,
film.length as length

from film 
join film_category on film.film_id = film_category.film_id
join category on category.category_id = film_category.category_id

where category.name = 'Comedy'
order by film.length
limit 10
;
'''
pd.read_sql_query(query,engine)

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

2. Tampilkan daftar lengkap kategori film beserta jumlah film tiap kategori & rata-rata harga sewa DVD film tiap kategori.

In [62]:
query='''
select * from film_category limit 1;
'''
pd.read_sql_query(query,engine)

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09

In [61]:
query='''
select * from payment limit 1;
'''
pd.read_sql_query(query,engine)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30

In [66]:
query='''
select * from rental limit 1;
'''
pd.read_sql_query(query,engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53

In [29]:
query='''
select 
category.name as category,
count(category.name) as length
avg(payment.amount) as rataHargaSewa

from film 
join film_category on film.film_id = film_category.film_id
join category on category.category_id = film_category.category_id

group by category.name
;
'''
pd.read_sql_query(query,engine)

ProgrammingError: (mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'avg(payment.amount) as rataHargaSewa

from film
join film_category on film.film' at line 4
[SQL:
select
category.name as category,
count(category.name) as length
avg(payment.amount) as rataHargaSewa

from film
join film_category on film.film_id = film_category.film_id
join category on category.category_id = film_category.category_id

group by category.name
;
]
(Background on this error at: http://sqlalche.me/e/f405)

3. Tampilkan daftar 10 aktor/aktris yang paling banyak membintangi film.

In [28]:
# menampilkan table yang diperlukan

In [25]:
query='''
select * from actor limit 1;
'''
pd.read_sql_query(query,engine)

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33

In [26]:
query='''
select * from film_actor limit 1;
'''
pd.read_sql_query(query,engine)

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03

In [27]:
query='''
select * from film limit 1;
'''
pd.read_sql_query(query,engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42

In [38]:
# select untuk memilih kolom apa saja yg mau ditampilkan
# from dan join menghubungkan antar tabel dengan using kolom yg memiliki value yg sama
# group by untuk mengelompokkan actor_id dgn menghitung jumlah_Movie
# diurutkan berdasarkan jumlah_movie dari yg paling banyak
# diambil 10 yg paling besar

query='''
select 
actor.actor_id,
actor.first_name,
actor.last_name,
count(film.film_id) as jumlah_Movie

from film_actor 
join film using (film_id)
join actor using (actor_id)

group by actor.actor_id
order by count(film_actor.film_id) desc
limit 10
;
'''
pd.read_sql_query(query,engine)

   actor_id first_name  last_name  jumlah_Movie
0       107       GINA  DEGENERES            42
1       102     WALTER       TORN            41
2       198       MARY     KEITEL            40
3       181    MATTHEW     CARREY            39
4        23     SANDRA     KILMER            37
5        81   SCARLETT      DAMON            36
6        37        VAL     BOLGER            35
7       158     VIVIEN   BASINGER            35
8       106    GROUCHO      DUNST            35
9        13        UMA       WOOD            35

4. Dari soal sebelumnya diketahui Gina Degeneres merupakan aktris yang paling banyak membintangi film, dengan total 42 judul film. . Kategori film apakah yang paling banyak dibintanginya?

In [ ]:
#  menampilkan table yg diperlukan

In [46]:
query='''
select * from film_actor limit 1;
'''
pd.read_sql_query(query,engine)

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03

In [40]:
query='''
select * from actor limit 1;
'''
pd.read_sql_query(query,engine)

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33

In [47]:
query='''
select * from film_category limit 1;
'''
pd.read_sql_query(query,engine)

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09

In [41]:
query='''
select * from category limit 1;
'''
pd.read_sql_query(query,engine)

   category_id    name         last_update
0            1  Action 2006-02-15 04:46:27

In [54]:
# select untuk memilih kolom apa saja yg mau ditampilkan
# from dan join menghubungkan antar tabel dengan using kolom yg memiliki value yg sama
# where untuk condition first_name = 'Gina' dan last_name = 'Degeneres'
# group by untuk mengelompokkan category berdasarkan jumlah film pada category tersebut

query='''
select 
category.name as category,
count(film_category.film_id) as jumlah_Movie

from film_actor , actor , film_category , category 
where (film_actor.actor_id = actor.actor_id)
and (film_category.category_id = category.category_id)
and (film_actor.film_id = film_category.film_id)

and actor.first_name = 'Gina'
and actor.last_name = 'Degeneres'
group by category.name

;
'''
pd.read_sql_query(query,engine)

       category  jumlah_Movie
0   Documentary             3
1       Foreign             2
2         Music             4
3           New             1
4        Sci-Fi             7
5        Action             3
6         Drama             2
7     Animation             4
8        Horror             1
9        Family             4
10       Comedy             3
11     Children             2
12     Classics             2
13       Sports             2
14        Games             1
15       Travel             1

5. Dari soal sebelumnya diketahui Gina Degeneres paling banyak membintangi film bergenre sciencefiction, dengan total 7 judul film. Tampilkan daftar judul film sci-fi yang pernah dibintangi oleh Gina Degeneres.

In [ ]:
# menampilkan tambahan tabel yang diperlukan dari nomor 4

In [56]:
query='''
select * from film limit 1;
'''
pd.read_sql_query(query,engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42

In [58]:
# select untuk memilih kolom apa saja yg mau ditampilkan
# from, where, dan and menghubungkan antar tabel dengan using kolom yg memiliki value yg sama (implicite join), serta membuat condition
# condition dimana actor.first_name = 'Gina' dan actor.last_name = 'Degeneres' dan category.name = 'Sci-Fi'

query='''
select 
film.title,
category.name as category

from film_actor , actor , film_category , category , film 
where (film_actor.actor_id = actor.actor_id)
and (film_category.category_id = category.category_id)
and (film_actor.film_id = film_category.film_id)
and (film.film_id = film_actor.film_id)

and actor.first_name = 'Gina'
and actor.last_name = 'Degeneres'
and category.name = 'Sci-Fi'
;
'''
pd.read_sql_query(query,engine)

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi